bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <FS.h>
#include <LittleFS.h>
#include <HTTPClient.h>
#include <ESP32Ping.h>
#include <mbedtls/base64.h>
#include <WiFiUdp.h>
#include <Arduino_SNMP_Manager.h>
#include <regex.h>
#include <time.h>
#include <esp_random.h>

// MeshCore layered protocol implementation
#include "MeshCore.hpp"

#include "config.hpp"

bool isNtfyConfigured() {
  return strlen(NTFY_TOPIC) > 0;
}

bool isDiscordConfigured() {
  return strlen(DISCORD_WEBHOOK_URL) > 0;
}

bool isSmtpConfigured() {
  return strlen(SMTP_SERVER) > 0 && strlen(SMTP_FROM_ADDRESS) > 0 &&
         strlen(SMTP_TO_ADDRESS) > 0;
}

bool isMeshCoreConfigured() {
  return strlen(BLE_PEER_NAME) > 0;
}

void sendNtfyNotification(const String& title, const String& message, const String& tags = "warning,monitor");
void sendDiscordNotification(const String& title, const String& message);
void sendSmtpNotification(const String& title, const String& message);
void sendMeshCoreNotification(const String& title, const String& message);
void initMeshCore();
void disconnectMeshCore();
void disconnectWiFi();
void reconnectWiFi();

AsyncWebServer server(80);

// MeshCore Protocol Stack (layered architecture)
// Layer 1: BLE Transport - handles BLE connection and I/O
// Layer 2: Frame Codec - handles frame parsing/building  
// Layer 3: Companion Protocol - handles MeshCore protocol logic
static BLECentralTransport* meshTransport = nullptr;
static FrameCodec* meshCodec = nullptr;
static CompanionProtocol* meshProtocol = nullptr;

// BLE/WiFi coexistence - ESP32-S3 cannot run WiFi and BLE simultaneously
bool bleOperationInProgress = false;
bool monitoringPaused = false;

// Minimum valid Unix timestamp for NTP validation (2021-01-01 00:00:00 UTC)
// Used to detect if time has been properly synchronized via NTP
const time_t MIN_VALID_TIMESTAMP = 1609459200;

// Pending MeshCore notification - used to defer BLE operations from HTTP handlers
// This prevents task watchdog timeouts by allowing the async web server to complete
// HTTP response delivery before WiFi is disconnected for BLE operations.
volatile bool pendingMeshNotification = false;
String pendingMeshTitle = "";
String pendingMeshMessage = "";

// Helper functions to access protocol state (for API compatibility)
bool isMeshDeviceConnected() {
  return meshTransport != nullptr && meshTransport->isConnected();
}

bool isMeshChannelReady() {
  return meshProtocol != nullptr && meshProtocol->isChannelReady();
}

String getMeshLastError() {
  if (meshProtocol != nullptr) {
    return meshProtocol->getLastError();
  }
  if (meshTransport != nullptr) {
    return meshTransport->getLastError();
  }
  return "";
}

int getMeshProtocolState() {
  if (meshProtocol != nullptr) {
    return static_cast<int>(meshProtocol->getState());
  }
  return 0;
}

// Service types
// Right now the behavior for each is rudimentary
// However, you can use this to expand and add services with more complex checks
enum ServiceType {
  TYPE_HTTP_GET,
  TYPE_PING,
  TYPE_SNMP_GET,
  TYPE_PORT,
  TYPE_PUSH
};

// SNMP comparison operators for value checks
enum SnmpCompareOp {
  SNMP_OP_EQ,    // Equal (=)
  SNMP_OP_NE,    // Not equal (<>)
  SNMP_OP_LT,    // Less than (<)
  SNMP_OP_LE,    // Less than or equal (<=)
  SNMP_OP_GT,    // Greater than (>)
  SNMP_OP_GE     // Greater than or equal (>=)
};

// Service structure
struct Service {
  String id;
  String name;
  ServiceType type;
  String host;
  int port;
  String path;
  String url;             // Full URL for HTTP GET (http:// or https://)
  String expectedResponse;
  int checkInterval;
  int passThreshold;      // Number of consecutive passes required to mark as UP
  int failThreshold;      // Number of consecutive fails required to mark as DOWN
  int rearmCount;         // Number of failed checks before re-alerting (0 = disabled)
  int consecutivePasses;  // Current count of consecutive passes
  int consecutiveFails;   // Current count of consecutive fails
  int failedChecksSinceAlert; // Failed checks since last alert (for re-arm)
  bool isUp;
  bool hasBeenUp;         // Whether service has ever been UP since boot (for initial UP suppression)
  unsigned long lastCheck;
  unsigned long lastUptime;
  String lastError;
  int secondsSinceLastCheck;
  // SNMP-specific fields
  String snmpOid;         // SNMP OID to query (e.g., "1.3.6.1.2.1.1.1.0")
  String snmpCommunity;   // SNMP community string (default: "public")
  SnmpCompareOp snmpCompareOp;  // Comparison operator for SNMP value check
  String snmpExpectedValue;     // Expected value for comparison
  // Push-specific fields
  String pushToken;       // Unique token for push endpoint (for TYPE_PUSH)
  unsigned long lastPush; // Timestamp of last push received (millis)
  // Enable/disable and pause fields
  bool enabled;           // Whether service checks are enabled
  unsigned long pauseUntil; // Timestamp (millis) until which checks are paused (0 = not paused)
};

// Store up to 20 services
const int MAX_SERVICES = 20;
Service services[MAX_SERVICES];
int serviceCount = 0;

// Port check constants
const int PORT_CHECK_TIMEOUT_MS = 5000;  // TCP connection timeout for port checks

// Push check constants
const unsigned long PUSH_TIMING_MARGIN_MS = 5000;  // Margin for push timing checks

// Regex matching constants
const int MAX_REGEX_PATTERN_LENGTH = 256;
const char* REGEX_PREFIX = "regex:";
const int REGEX_PREFIX_LENGTH = 6;

// Pause/enable constants
// Max pause: ~46 days to safely fit within unsigned long (millis() range)
const int MAX_PAUSE_DURATION_SECONDS = 46 * 24 * 60 * 60;  // 46 days
const unsigned long PAUSE_ROLLOVER_THRESHOLD_MS = 7UL * 24UL * 60UL * 60UL * 1000UL;  // 1 week

// Helper function for rollover-safe pause remaining calculation
// Returns pause remaining in milliseconds, or 0 if pause expired/rolled over
inline unsigned long getPauseRemainingMs(unsigned long pauseUntil, unsigned long currentTime) {
  if (pauseUntil == 0) return 0;
  // If currentTime has passed pauseUntil (normal expiry), remaining will wrap to large value
  // If pauseUntil is in the future, remaining will be the actual time left
  // Both cases are handled by the threshold check below
  unsigned long remaining = pauseUntil - currentTime;
  // If remaining is larger than threshold, assume expired or rollover/reboot
  if (remaining > PAUSE_ROLLOVER_THRESHOLD_MS) return 0;
  return remaining;
}

// Notification queue for failed notifications
// Only stores the latest notification per service (isUp state)
// Tracks which notification channels have failed
struct QueuedNotification {
  String serviceId;      // Service ID this notification is for
  String title;          // Notification title
  String message;        // Notification message
  bool isUp;             // true = online notification, false = offline notification
  String tags;           // ntfy tags (for ntfy notifications)
  bool ntfyPending;      // Needs to be sent via ntfy
  bool discordPending;   // Needs to be sent via Discord
  bool smtpPending;      // Needs to be sent via SMTP
  bool meshPending;      // Needs to be sent via MeshCore
  unsigned long lastRetry; // Last retry attempt timestamp
};

