bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    if (!found) {
      request->send(404, "application/json", "{\"error\":\"Invalid push token\"}");
    }
  });

  server.begin();
  Serial.println("Web server started");
}

String generateServiceId() {
  return String(millis()) + String(random(1000, 9999));
}

String generatePushToken() {
  // Generate a 16-character hex token for push endpoints
  // Uses ESP32's hardware random number generator for better entropy
  String token = "";
  const char hexChars[] = "0123456789abcdef";
  for (int i = 0; i < 16; i++) {
    token += hexChars[esp_random() % 16];
  }
  return token;
}

void checkServices() {
  // Skip all network-dependent checks if WiFi is not connected
  // This prevents crashes from network operations when WiFi is unavailable
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }

  unsigned long currentTime = millis();

  for (int i = 0; i < serviceCount; i++) {
    // Skip disabled services
    if (!services[i].enabled) {
      continue;
    }

    // Skip paused services (using rollover-safe helper function)
    if (services[i].pauseUntil > 0) {
      unsigned long remaining = getPauseRemainingMs(services[i].pauseUntil, currentTime);
      if (remaining > 0) {
        continue;  // Pause is still active
      }
      // Pause has expired or rollover detected - clear it
      services[i].pauseUntil = 0;
    }

    // Check if it's time to check this service
    if (currentTime - services[i].lastCheck < services[i].checkInterval * 1000) {
      continue;
    }

    services[i].lastCheck = currentTime;
    bool wasUp = services[i].isUp;

    // Perform the actual check
    bool checkResult = false;
    switch (services[i].type) {
      case TYPE_HTTP_GET:
        checkResult = checkHttpGet(services[i]);
        break;
      case TYPE_PING:
        checkResult = checkPing(services[i]);
        break;
      case TYPE_SNMP_GET:
        checkResult = checkSnmpGet(services[i]);
        break;
      case TYPE_PORT:
        checkResult = checkPort(services[i]);
        break;
      case TYPE_PUSH:
        checkResult = checkPush(services[i]);
        break;
    }

    // Update consecutive counters based on check result
    if (checkResult) {
      services[i].consecutivePasses++;
      services[i].consecutiveFails = 0;
      services[i].lastUptime = currentTime;
      services[i].lastError = "";
      services[i].failedChecksSinceAlert = 0;  // Reset re-arm counter on success
    } else {
      services[i].consecutiveFails++;
      services[i].consecutivePasses = 0;
    }

    // Determine new state based on thresholds
    if (!services[i].isUp && services[i].consecutivePasses >= services[i].passThreshold) {
      // Service has passed enough times to be considered UP
      services[i].isUp = true;
      services[i].failedChecksSinceAlert = 0;  // Reset re-arm counter on recovery
    } else if (services[i].isUp && services[i].consecutiveFails >= services[i].failThreshold) {
      // Service has failed enough times to be considered DOWN
      services[i].isUp = false;
    }

    // Log and notify on state changes
    if (wasUp != services[i].isUp) {
      Serial.printf("Service '%s' is now %s (after %d consecutive %s)\n",
        services[i].name.c_str(),
        services[i].isUp ? "UP" : "DOWN",
        services[i].isUp ? services[i].consecutivePasses : services[i].consecutiveFails,
        services[i].isUp ? "passes" : "fails");

      if (!services[i].isUp) {
        sendOfflineNotification(services[i]);
        services[i].failedChecksSinceAlert = 0;  // Reset counter after initial alert
      } else if (services[i].hasBeenUp) {
        // Only send online notification if service was previously UP (not initial UP after boot)
        sendOnlineNotification(services[i]);
      }
      
      // Mark that service has been UP at least once (for initial UP notification suppression)
      if (services[i].isUp) {
        services[i].hasBeenUp = true;
      }
    } else if (!services[i].isUp && !checkResult && services[i].rearmCount > 0) {
      // Service is still DOWN and check failed - handle re-arm logic
      services[i].failedChecksSinceAlert++;
      if (services[i].failedChecksSinceAlert >= services[i].rearmCount) {
        Serial.printf("Service '%s' still DOWN - re-arming alert after %d failed checks\n",
          services[i].name.c_str(), services[i].failedChecksSinceAlert);
        sendOfflineNotification(services[i]);
        services[i].failedChecksSinceAlert = 0;  // Reset counter after re-arm alert
      }
    }
  }
}

// Helper function to match text against a POSIX extended regex pattern
// Returns 0 on match, 1 on no match, -1 on pattern too long, -2 on invalid pattern
int matchesRegex(const String& text, const String& pattern) {
  // Limit pattern length to prevent excessive resource usage
  if (pattern.length() > MAX_REGEX_PATTERN_LENGTH) {
    return -1;
  }
  
  regex_t regex;
  int result;
  
  // Compile the regex pattern with extended syntax
  result = regcomp(&regex, pattern.c_str(), REG_EXTENDED | REG_NOSUB);
  if (result != 0) {
    // Pattern compilation failed - do not call regfree() on failed compile
    return -2;
  }
  
  // Execute the regex match
  result = regexec(&regex, text.c_str(), 0, NULL, 0);
  regfree(&regex);
  
  return result == 0 ? 0 : 1;  // 0 = match, 1 = no match
}

bool checkHttpGet(Service& service) {
  HTTPClient http;
  
  // Use the URL field directly - supports both HTTP and HTTPS
  String url = service.url;
  
  // Handle empty URL
  if (url.length() == 0) {
    service.lastError = "URL not configured";
    return false;
  }
  
  // Handle HTTPS URLs by using WiFiClientSecure
  bool isSecure = url.startsWith("https://");
  
  if (isSecure) {
    WiFiClientSecure secureClient;
    secureClient.setInsecure();  // Skip certificate validation
    http.begin(secureClient, url);
  } else {
    http.begin(url);
  }
  
  http.setTimeout(5000);

  int httpCode = http.GET();
  bool isUp = false;

  if (httpCode > 0) {
    if (httpCode == 200) {
      if (service.expectedResponse == "*") {
        isUp = true;
      } else {
        String payload = http.getString();
        // Check if expectedResponse is a regex pattern (prefixed with "regex:")
        if (service.expectedResponse.startsWith(REGEX_PREFIX)) {
          String pattern = service.expectedResponse.substring(REGEX_PREFIX_LENGTH);
          int regexResult = matchesRegex(payload, pattern);
          if (regexResult == 0) {
            isUp = true;
          } else if (regexResult == -1) {
            service.lastError = "Regex pattern too long";
          } else if (regexResult == -2) {
            service.lastError = "Invalid regex pattern";
          } else {
            service.lastError = "Regex mismatch";
          }
        } else {
          // Plain substring match
          isUp = payload.indexOf(service.expectedResponse) >= 0;
          if (!isUp) {
            service.lastError = "Response mismatch";
          }
        }
      }
    } else {
      service.lastError = "HTTP " + String(httpCode);
    }
  } else {
    service.lastError = "Connection failed: " + String(httpCode);
  }

  http.end();
  return isUp;
}

bool checkPing(Service& service) {
  bool success = Ping.ping(service.host.c_str(), 3);
  if (!success) {
    service.lastError = "Ping timeout";
  }
  return success;
}

bool checkPort(Service& service) {
  WiFiClient client;
  // Attempt TCP connection with configured timeout
  if (client.connect(service.host.c_str(), service.port, PORT_CHECK_TIMEOUT_MS)) {
    client.stop();
    return true;
  }
  service.lastError = "Port closed or unreachable";
  return false;
}

bool checkPush(Service& service) {
  // For push-based services, check if a push was received within the check interval
  unsigned long currentTime = millis();
  
