bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  // If no push has ever been received, treat as not up yet
  if (service.lastPush == 0) {
    service.lastError = "No push received yet";
    return false;
  }
  
  // Check if a push was received within the last check interval period
  // We add some margin to account for timing variations
  unsigned long pushAge = currentTime - service.lastPush;
  unsigned long intervalMs = (unsigned long)service.checkInterval * 1000UL;
  
  if (pushAge <= intervalMs + PUSH_TIMING_MARGIN_MS) {
    return true;
  }
  
  service.lastError = "No push received within interval";
  return false;
}

// Helper function to compare SNMP values based on operator
bool compareSnmpValue(const String& actualValue, SnmpCompareOp op, const String& expectedValue) {
  // Try numeric comparison first
  bool actualIsNumeric = true;
  bool expectedIsNumeric = true;
  float actualNum = 0;
  float expectedNum = 0;
  
  // Check if actual value is numeric
  if (actualValue.length() > 0) {
    char* endPtr;
    actualNum = strtof(actualValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      actualIsNumeric = false;
    }
  } else {
    actualIsNumeric = false;
  }
  
  // Check if expected value is numeric
  if (expectedValue.length() > 0) {
    char* endPtr;
    expectedNum = strtof(expectedValue.c_str(), &endPtr);
    if (*endPtr != '\0') {
      expectedIsNumeric = false;
    }
  } else {
    expectedIsNumeric = false;
  }
  
  // Use numeric comparison if both are numeric
  if (actualIsNumeric && expectedIsNumeric) {
    switch (op) {
      case SNMP_OP_EQ: return actualNum == expectedNum;
      case SNMP_OP_NE: return actualNum != expectedNum;
      case SNMP_OP_LT: return actualNum < expectedNum;
      case SNMP_OP_LE: return actualNum <= expectedNum;
      case SNMP_OP_GT: return actualNum > expectedNum;
      case SNMP_OP_GE: return actualNum >= expectedNum;
    }
  }
  
  // Fall back to string comparison for non-numeric values
  int cmp = actualValue.compareTo(expectedValue);
  switch (op) {
    case SNMP_OP_EQ: return cmp == 0;
    case SNMP_OP_NE: return cmp != 0;
    case SNMP_OP_LT: return cmp < 0;
    case SNMP_OP_LE: return cmp <= 0;
    case SNMP_OP_GT: return cmp > 0;
    case SNMP_OP_GE: return cmp >= 0;
  }
  
  return false;
}

bool checkSnmpGet(Service& service) {
  // Resolve hostname to IP
  IPAddress targetIP;
  if (!WiFi.hostByName(service.host.c_str(), targetIP)) {
    service.lastError = "DNS resolution failed";
    return false;
  }
  
  // Create SNMP objects for this request
  WiFiUDP udp;
  SNMPManager snmpManager(service.snmpCommunity.c_str());
  SNMPGet snmpRequest(service.snmpCommunity.c_str(), 1);  // SNMP version 2c (0=v1, 1=v2c)
  
  // Initialize SNMP manager
  snmpManager.setUDP(&udp);
  snmpManager.begin();
  
  // Use local variables to avoid thread safety issues
  // Use special marker values to detect if they were updated
  char stringValue[256];
  char* stringValuePtr = stringValue;
  stringValue[0] = '\0';
  
  // Use special marker value that's unlikely to be a real SNMP response
  // INT32_MIN is used as a sentinel to detect if the value was updated
  int intValue = INT32_MIN;
  
  String responseValue = "";
  bool gotResponse = false;
  
  // Add handler for string values (covers most SNMP types including OctetString)
  ValueCallback* stringCallback = snmpManager.addStringHandler(targetIP, service.snmpOid.c_str(), &stringValuePtr);
  
  // Also add integer handler for numeric values
  ValueCallback* intCallback = snmpManager.addIntegerHandler(targetIP, service.snmpOid.c_str(), &intValue);
  
  // Build and send SNMP request - add both callbacks
  snmpRequest.addOIDPointer(stringCallback);
  snmpRequest.addOIDPointer(intCallback);
  snmpRequest.setIP(WiFi.localIP());
  snmpRequest.setUDP(&udp);
  snmpRequest.setRequestID(random(1, 65535));
  
  if (!snmpRequest.sendTo(targetIP)) {
    service.lastError = "Failed to send SNMP request";
    return false;
  }
  snmpRequest.clearOIDList();
  
  // Wait for response with timeout (5 seconds)
  unsigned long startTime = millis();
  const unsigned long timeout = 5000;
  
  while (millis() - startTime < timeout) {
    snmpManager.loop();
    
    // Check if we got a string response (non-empty string)
    if (stringValue[0] != '\0') {
      responseValue = String(stringValue);
      gotResponse = true;
      break;
    }
    
    // Check if we got an integer response (value changed from sentinel)
    if (intValue != INT32_MIN) {
      responseValue = String(intValue);
      gotResponse = true;
      break;
    }
    
    // Yield to prevent watchdog timeout
    vTaskDelay(pdMS_TO_TICKS(10));
  }
  
  if (!gotResponse) {
    service.lastError = "SNMP timeout";
    return false;
  }
  
  // Compare the received value with expected value
  bool success = compareSnmpValue(responseValue, service.snmpCompareOp, service.snmpExpectedValue);
  
  if (!success) {
    service.lastError = "Value mismatch: got '" + responseValue + "', expected " + 
                        getSnmpCompareOpString(service.snmpCompareOp) + " '" + 
                        service.snmpExpectedValue + "'";
  }
  
  return success;
}

String getSnmpCompareOpString(SnmpCompareOp op) {
  switch (op) {
    case SNMP_OP_EQ: return "=";
    case SNMP_OP_NE: return "<>";
    case SNMP_OP_LT: return "<";
    case SNMP_OP_LE: return "<=";
    case SNMP_OP_GT: return ">";
    case SNMP_OP_GE: return ">=";
    default: return "=";
  }
}

SnmpCompareOp parseSnmpCompareOp(const String& opStr) {
  if (opStr == "=" || opStr == "eq") return SNMP_OP_EQ;
  if (opStr == "<>" || opStr == "ne") return SNMP_OP_NE;
  if (opStr == "<" || opStr == "lt") return SNMP_OP_LT;
  if (opStr == "<=" || opStr == "le") return SNMP_OP_LE;
  if (opStr == ">" || opStr == "gt") return SNMP_OP_GT;
  if (opStr == ">=" || opStr == "ge") return SNMP_OP_GE;
  return SNMP_OP_EQ;  // Default to equal
}

void sendOfflineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured() && !isMeshCoreConfigured()) {
    return;
  }

  bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String title = "Service DOWN: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0 && service.type != TYPE_PING) {
    message += ":" + String(service.port);
  }
  message += " is offline.";

  if (service.lastError.length() > 0) {
    message += " Error: " + service.lastError;
  }

  String tags = "warning,monitor";
  bool ntfyFailed = false;
  bool discordFailed = false;
  bool smtpFailed = false;
  bool meshFailed = false;

  if (wifiConnected) {
    if (isNtfyConfigured()) {
      if (!sendNtfyNotificationWithStatus(title, message, tags)) {
        ntfyFailed = true;
      }
    }

