bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
    if (isDiscordConfigured()) {
      if (!sendDiscordNotificationWithStatus(title, message)) {
        discordFailed = true;
      }
    }

    if (isSmtpConfigured()) {
      if (!sendSmtpNotificationWithStatus(title, message)) {
        smtpFailed = true;
      }
    }
  } else {
    Serial.println("WiFi offline: queueing internet notifications");
    ntfyFailed = isNtfyConfigured();
    discordFailed = isDiscordConfigured();
    smtpFailed = isSmtpConfigured();
  }

  if (isMeshCoreConfigured()) {
    if (!sendMeshCoreNotificationWithStatus(title, message)) {
      meshFailed = true;
    }
  }

  // Queue any failed notifications for retry
  queueNotification(service.id, title, message, false, tags, 
                    ntfyFailed, discordFailed, smtpFailed, meshFailed);
}

void sendOnlineNotification(const Service& service) {
  if (!isNtfyConfigured() && !isDiscordConfigured() && !isSmtpConfigured() && !isMeshCoreConfigured()) {
    return;
  }

  bool wifiConnected = WiFi.status() == WL_CONNECTED;

  String title = "Service UP: " + service.name;
  String message = "Service '" + service.name + "' at " + service.host;
  if (service.port > 0 && service.type != TYPE_PING) {
    message += ":" + String(service.port);
  }
  message += " is back online.";

  String tags = "ok,monitor";
  bool ntfyFailed = false;
  bool discordFailed = false;
  bool smtpFailed = false;
  bool meshFailed = false;

  if (wifiConnected) {
    if (isNtfyConfigured()) {
      if (!sendNtfyNotificationWithStatus(title, message, tags)) {
        ntfyFailed = true;
      }
    }

    if (isDiscordConfigured()) {
      if (!sendDiscordNotificationWithStatus(title, message)) {
        discordFailed = true;
      }
    }

    if (isSmtpConfigured()) {
      if (!sendSmtpNotificationWithStatus(title, message)) {
        smtpFailed = true;
      }
    }
  } else {
    Serial.println("WiFi offline: queueing internet notifications");
    ntfyFailed = isNtfyConfigured();
    discordFailed = isDiscordConfigured();
    smtpFailed = isSmtpConfigured();
  }

  if (isMeshCoreConfigured()) {
    if (!sendMeshCoreNotificationWithStatus(title, message)) {
      meshFailed = true;
    }
  }

  // Queue any failed notifications for retry
  queueNotification(service.id, title, message, true, tags, 
                    ntfyFailed, discordFailed, smtpFailed, meshFailed);
}

void sendNtfyNotification(const String& title, const String& message, const String& tags) {
  HTTPClient http;
  String url = String(NTFY_SERVER) + "/" + NTFY_TOPIC;

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }
  http.addHeader("Title", title);
  http.addHeader("Tags", tags);
  http.addHeader("Content-Type", "text/plain");

  if (strlen(NTFY_ACCESS_TOKEN) > 0) {
    http.addHeader("Authorization", "Bearer " + String(NTFY_ACCESS_TOKEN));
  } else if (strlen(NTFY_USERNAME) > 0) {
    http.setAuthorization(NTFY_USERNAME, NTFY_PASSWORD);
  }

  int httpCode = http.POST(message);

  if (httpCode > 0) {
    Serial.printf("ntfy notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send ntfy notification: %d\n", httpCode);
  }

  http.end();
}

void sendDiscordNotification(const String& title, const String& message) {
  HTTPClient http;
  String url = String(DISCORD_WEBHOOK_URL);

  WiFiClientSecure client;
  bool isSecure = url.startsWith("https://");
  if (isSecure) {
    client.setInsecure();
    http.begin(client, url);
  } else {
    http.begin(url);
  }

  http.addHeader("Content-Type", "application/json");

  JsonDocument doc;
  doc["content"] = "**" + title + "**\n" + message;

  String payload;
  serializeJson(doc, payload);

  int httpCode = http.POST(payload);

  if (httpCode > 0) {
    Serial.printf("Discord notification sent: %d\n", httpCode);
  } else {
    Serial.printf("Failed to send Discord notification: %d\n", httpCode);
  }

  http.end();
}

void sendMeshCoreNotification(const String& title, const String& message) {
  // ESP32-S3 cannot run WiFi and BLE simultaneously
  // Disconnect WiFi, connect BLE, send message, disconnect BLE, reconnect WiFi
  
  Serial.println("Starting MeshCore notification (BLE operation)...");
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on heap to reduce stack usage.
  // Stack overflow can occur when these large objects are combined with
  // deep BLE callback chains during sendTextMessageToChannel.
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport* transport = new BLECentralTransport(config);
  FrameCodec* codec = new FrameCodec(*transport);
  CompanionProtocol* protocol = new CompanionProtocol(*transport, *codec);
  
  bool success = false;
  
  // Initialize and connect
  if (transport->init()) {
    if (transport->connect()) {
      // Start session
      if (protocol->startSession("ESP32-Uptime")) {
        // Find the configured channel
        uint8_t channelIdx;
        if (protocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
          // Build the message: combine title and message
          String fullMessage = title + ": " + message;
          
          // Send using the protocol layer
          if (protocol->sendTextMessageToChannel(channelIdx, fullMessage)) {
            Serial.println("MeshCore notification sent successfully");
            success = true;
          } else {
            Serial.printf("MeshCore notification failed: send error - %s\n", protocol->getLastError().c_str());
          }
        } else {
          Serial.printf("MeshCore notification skipped: channel not found - %s\n", protocol->getLastError().c_str());
        }
      } else {
        Serial.printf("MeshCore notification skipped: session start failed - %s\n", protocol->getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore notification skipped: not connected - %s\n", transport->getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore notification skipped: BLE init failed - %s\n", transport->getLastError().c_str());
  }
  
  // Clear callbacks before cleanup to prevent use-after-free.
  // BLE callbacks could fire during disconnect/deinit and would reference deleted objects.
  codec->clearCallbacks();
  
