bradhawkins85/ESP32-Uptime-Monitoring/src/main.cpp
  if (existingIndex >= 0) {
    // Update existing notification with latest state
    // This ensures we only keep the most recent state (up or down)
    QueuedNotification& existing = notificationQueue[existingIndex];
    existing.title = title;
    existing.message = message;
    existing.isUp = isUp;
    existing.tags = tags;
    existing.ntfyPending = ntfyFailed;
    existing.discordPending = discordFailed;
    existing.smtpPending = smtpFailed;
    existing.meshPending = meshFailed;
    existing.lastRetry = millis();
    Serial.printf("Updated queued notification for service %s (now %s)\n", 
                  serviceId.c_str(), isUp ? "UP" : "DOWN");
  } else {
    // Add new notification to queue
    if (queuedNotificationCount >= MAX_QUEUED_NOTIFICATIONS) {
      Serial.println("Notification queue full, dropping oldest");
      removeQueuedNotification(0);
    }
    
    QueuedNotification& newNotification = notificationQueue[queuedNotificationCount];
    newNotification.serviceId = serviceId;
    newNotification.title = title;
    newNotification.message = message;
    newNotification.isUp = isUp;
    newNotification.tags = tags;
    newNotification.ntfyPending = ntfyFailed;
    newNotification.discordPending = discordFailed;
    newNotification.smtpPending = smtpFailed;
    newNotification.meshPending = meshFailed;
    newNotification.lastRetry = millis();
    queuedNotificationCount++;
    Serial.printf("Queued notification for service %s (%s), %d in queue\n", 
                  serviceId.c_str(), isUp ? "UP" : "DOWN", queuedNotificationCount);
  }
}

void processNotificationQueue() {
  if (queuedNotificationCount == 0) return;
  
  unsigned long currentTime = millis();
  bool wifiConnected = WiFi.status() == WL_CONNECTED;
  
  // Process each queued notification (WiFi-based channels only)
  for (int i = 0; i < queuedNotificationCount; i++) {
    QueuedNotification& notification = notificationQueue[i];
    
    // Check if enough time has passed since last retry
    if (currentTime - notification.lastRetry < NOTIFICATION_RETRY_INTERVAL) {
      continue;
    }
    
    notification.lastRetry = currentTime;
    
    // Retry WiFi-based notifications only if WiFi is connected
    if (wifiConnected) {
      if (notification.ntfyPending && isNtfyConfigured()) {
        if (sendNtfyNotificationWithStatus(notification.title, notification.message, notification.tags)) {
          notification.ntfyPending = false;
          Serial.printf("Retry: ntfy notification sent for %s\n", notification.serviceId.c_str());
        }
      }
      
      if (notification.discordPending && isDiscordConfigured()) {
        if (sendDiscordNotificationWithStatus(notification.title, notification.message)) {
          notification.discordPending = false;
          Serial.printf("Retry: Discord notification sent for %s\n", notification.serviceId.c_str());
        }
      }
      
      if (notification.smtpPending && isSmtpConfigured()) {
        if (sendSmtpNotificationWithStatus(notification.title, notification.message)) {
          notification.smtpPending = false;
          Serial.printf("Retry: SMTP notification sent for %s\n", notification.serviceId.c_str());
        }
      }
    }
    
    // Check if all pending notifications for this service have been sent
    // (MeshCore is processed separately in processMeshCoreQueue)
    if (!notification.ntfyPending && !notification.discordPending && 
        !notification.smtpPending && !notification.meshPending) {
      Serial.printf("All notifications sent for %s, removing from queue\n", notification.serviceId.c_str());
      removeQueuedNotification(i);
      i--;  // Adjust index since we removed an element
    }
  }
}

void processMeshCoreQueue() {
  // Check if MeshCore is configured and if we have any pending MeshCore notifications
  if (!isMeshCoreConfigured() || bleOperationInProgress) return;
  
  // Check if any notifications have pending MeshCore messages
  bool hasPendingMesh = false;
  for (int i = 0; i < queuedNotificationCount; i++) {
    if (notificationQueue[i].meshPending) {
      hasPendingMesh = true;
      break;
    }
  }
  if (!hasPendingMesh) return;
  
  // Check if enough time has passed since last MeshCore retry (10 minutes)
  unsigned long currentTime = millis();
  if (currentTime - lastMeshCoreRetry < MESHCORE_RETRY_INTERVAL) {
    return;
  }
  
  Serial.println("Processing MeshCore queue (batched BLE operation)...");
  
  // Pause monitoring to prevent false positives during network transition
  monitoringPaused = true;
  bleOperationInProgress = true;
  lastMeshCoreRetry = currentTime;
  
  // Disconnect WiFi before starting BLE
  disconnectWiFi();
  
  // Create the layered protocol stack on heap to reduce stack usage.
  // Stack overflow can occur when these large objects are combined with
  // deep BLE callback chains during sendTextMessageToChannel.
  BLECentralTransport::Config config;
  config.deviceName = BLE_DEVICE_NAME;
  config.peerName = BLE_PEER_NAME;
  config.pairingPin = BLE_PAIRING_PIN;
  
  BLECentralTransport* transport = new BLECentralTransport(config);
  FrameCodec* codec = new FrameCodec(*transport);
  CompanionProtocol* protocol = new CompanionProtocol(*transport, *codec);
  
  bool sessionReady = false;
  uint8_t channelIdx = 0;
  
  // Initialize, connect and prepare session once
  if (transport->init()) {
    if (transport->connect()) {
      if (protocol->startSession("ESP32-Uptime")) {
        if (protocol->findChannelByName(BLE_MESH_CHANNEL_NAME, channelIdx)) {
          sessionReady = true;
          Serial.println("MeshCore session ready, sending queued messages...");
        } else {
          Serial.printf("MeshCore batch: channel not found - %s\n", protocol->getLastError().c_str());
        }
      } else {
        Serial.printf("MeshCore batch: session start failed - %s\n", protocol->getLastError().c_str());
      }
    } else {
      Serial.printf("MeshCore batch: not connected - %s\n", transport->getLastError().c_str());
    }
  } else {
    Serial.printf("MeshCore batch: BLE init failed - %s\n", transport->getLastError().c_str());
  }
  
  // Send all pending MeshCore notifications in this single session
  if (sessionReady) {
    for (int i = 0; i < queuedNotificationCount; i++) {
      QueuedNotification& notification = notificationQueue[i];
      if (notification.meshPending) {
        String fullMessage = notification.title + ": " + notification.message;
        if (protocol->sendTextMessageToChannel(channelIdx, fullMessage)) {
          notification.meshPending = false;
          Serial.printf("Retry: MeshCore notification sent for %s\n", notification.serviceId.c_str());
        } else {
          Serial.printf("MeshCore send failed for %s: %s\n", 
                        notification.serviceId.c_str(), protocol->getLastError().c_str());
        }
        // Small delay between messages to avoid overwhelming the receiver
        delay(100);
      }
    }
  }
  
  // Clear callbacks before cleanup to prevent use-after-free.
  // BLE callbacks could fire during disconnect/deinit and would reference deleted objects.
  codec->clearCallbacks();
  
